In [1]:
import pandas as pd
import numpy as np

In [3]:
cg = pd.read_csv('github_source/chicago_food_inspections.csv')
cg

                                      Name             Risk
0               MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                              JETS PIZZA   Risk 2 (Medium)
2                               ROOM 1520      Risk 3 (Low)
3                MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                            CHARTWELLS       Risk 1 (High)
...                                    ...              ...
153805                         WOLCOTT'S      Risk 1 (High)
153806     DUNKIN DONUTS/BASKIN-ROBBINS     Risk 2 (Medium)
153807                           Cafe 608     Risk 1 (High)
153808                        mr.daniel's     Risk 1 (High)
153809                         TEMPO CAFE     Risk 1 (High)

[153810 rows x 2 columns]

In [15]:
#برای رشته ها متودها روی سری ها و به کمک اس.تی.ار اوکی میشند
# حذف اسپیس های اضافی از چپ و راست رشته
cg['Name'].str.strip()

#با حلقه هم میشه روی کل ستونها زد نه فقط یک ستون
for col in cg.columns:
    cg[col] = cg[col].str.strip()
    #cg[col] = cg[col].str.strip()
    #cg[col] = cg[col].str.lower()
    #cg[col] = cg[col].str.title() #camle case

In [17]:
#شناسایی کل مقادیر یونیک این ستون
cg['Risk'].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All', nan],
      dtype=object)

In [19]:
cg = cg.dropna(subset=['Risk'])
cg['Risk'].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All'],
      dtype=object)

In [21]:
cg = cg.replace(to_replace='All', value='Risk 4 (Extreme)')
cg['Risk'].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)',
       'Risk 4 (Extreme)'], dtype=object)

In [22]:
#بیرون کشیدن عددهای ستونها ریسک
cg['Risk'].str.slice(5, 6)
cg['Risk'].str[5:6]

0         1
1         2
2         3
3         1
4         1
         ..
153805    1
153806    2
153807    1
153808    1
153809    1
Name: Risk, Length: 153744, dtype: object

In [29]:
cg['Risk'].str.slice(8, -1)
cg['Risk'].str[8:-1]

0           High
1         Medium
2            Low
3           High
4           High
           ...
153805      High
153806    Medium
153807      High
153808      High
153809      High
Name: Risk, Length: 153744, dtype: object

In [34]:
#دیدن یک زیررشته در یک رشته

#in python:
'pizza' in 'jax pizza'

#in pandas:
cg[cg['Name'].str.lower().str.contains('pizza')]

                                    Name             Risk
1                             JETS PIZZA  Risk 2 (Medium)
19         NANCY'S HOME OF STUFFED PIZZA    Risk 1 (High)
27            NARY'S GRILL & PIZZA ,INC.    Risk 1 (High)
29                   NARYS GRILL & PIZZA    Risk 1 (High)
68                         COLUTAS PIZZA    Risk 1 (High)
...                                  ...              ...
153756       ANGELO'S STUFFED PIZZA CORP    Risk 1 (High)
153764                COCHIAROS PIZZA #2    Risk 1 (High)
153772  FERNANDO'S MEXICAN GRILL & PIZZA    Risk 1 (High)
153788            REGGIO'S PIZZA EXPRESS    Risk 1 (High)
153801        State Street Pizza Company    Risk 1 (High)

[3992 rows x 2 columns]

In [36]:
#فقط برای این که این دو درست کار کنند، حتما قبلش استریپ را برای حذف قبل و بعد رشته بزنید
# cg['Name'] = cg['Name'].str.strip()

#حتما شروعش با اون زیررشته باشه
cg[cg['Name'].str.lower().str.startswith('pizza')]

#حتما پایانش با اون زیررشته باشه
cg[cg['Name'].str.lower().str.endswith('pizza')]

                                    Name             Risk
1                             JETS PIZZA  Risk 2 (Medium)
19         NANCY'S HOME OF STUFFED PIZZA    Risk 1 (High)
29                   NARYS GRILL & PIZZA    Risk 1 (High)
68                         COLUTAS PIZZA    Risk 1 (High)
92                           JET'S PIZZA  Risk 2 (Medium)
...                                  ...              ...
153622                    BARNEY'S PIZZA    Risk 1 (High)
153642                   GIORGIO'S PIZZA    Risk 1 (High)
153672                    DOMINO'S PIZZA  Risk 2 (Medium)
153685                    Congress Pizza    Risk 1 (High)
153772  FERNANDO'S MEXICAN GRILL & PIZZA    Risk 1 (High)

[2069 rows x 2 columns]

In [45]:
c = pd.read_csv('github_source/customers.csv')

# استفاده از رجکس برای حذف اعداد ابتدای کار ادرسها
c['Address'].str.replace('^\d+', '*', regex=True).head(3)

0    * Quinn Groves, East Matthew, New Hampshire, 1...
1    * Tracey Ports Apt. 419, Kyleport, Vermont, 31924
2        * Fleming Manors, Prestonstad, Montana, 23495
Name: Address, dtype: object

In [47]:
 #تعداد کارکترهای ستون اسم  البته با اسپیس ها
c['Name'].str.len()

0       13
1       17
2       15
3       19
4       14
        ..
9956    13
9957    15
9958    10
9959    16
9960    16
Name: Name, Length: 9961, dtype: int64

In [50]:
#اسپلیت کردن براساس اسپیس میانی و یکبار فقط
c['Name'].str.split(pat=' ', n=1)

#فقط اسم و بگیریم
#c['Name'].str.split(pat=' ', n=1).str.get(0)

# قفط فامیلو بگیریم
#c['Name'].str.split(pat=' ', n=1).str.get(1)

0           Frank
1       Elizabeth
2          Donald
3         Michael
4         Jasmine
          ...
9956         Dana
9957       Amanda
9958         Eric
9959       Taylor
9960       Sherry
Name: Name, Length: 9961, dtype: object

In [52]:
# به جای جدا جدا گرفتن میایم در قالب دیتا فریم خروجی را میگیرم
c['Name'].str.split(pat=' ', n=1, expand=True)

              0            1
0         Frank      Manning
1     Elizabeth      Johnson
2        Donald     Stephens
3       Michael  Vincent III
4       Jasmine       Zamora
...         ...          ...
9956       Dana     Browning
9957     Amanda     Anderson
9958       Eric        Davis
9959     Taylor    Hernandez
9960     Sherry    Nicholson

[9961 rows x 2 columns]

In [55]:
# به جای ستون اسم در دیتاست اصیل کلا حذفش کنیم و به جاش ستون اسم و فایل اضافه کنیم
c[['First Name', 'Last Name']] = c['Name'].str.split(pat=' ', n=1, expand=True)

#کافیه ستون اسم را حذف کنیم، اگه بریم سراغ دراپ میره که ردیف ها را حذف کنه ولی وقتی اکسیز را بهش بگیم ستون منظورمه، یعنی تو ستونها میره دنبال کلید واژه‌ی نیم میگرده تا حذف کنه اگه نمیزاشتی تو ردیفها دنبال کلید واژه‌ی نیم میگشت
c = c.drop(labels='Name', axis='columns')

c

,Address,First Name,Last Name
0,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora
...,...,...,...
9956,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning
9957,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson
9958,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis
9959,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez
9960,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson